Tekla.Structures.Catalogs.CatalogHandler
The CatalogHandler class is a class from which the user can query catalog instances.

Tekla.Structures.Catalogs.CatalogHandler.#ctor
Creates a new catalog handler instance.

Tekla.Structures.Catalogs.CatalogHandler.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established.
Currently, there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Catalogs.CatalogHandler.GetProfileItems
Returns an enumerator of all profile items.
Returns: A ProfileItemEnumerator of all profile items.

Tekla.Structures.Catalogs.CatalogHandler.GetLibraryProfileItems
Returns an enumerator of library profile items.
Returns: A ProfileItemEnumerator of library profile items.

Tekla.Structures.Catalogs.CatalogHandler.GetParametricProfileItems
Returns an enumerator of parametric profile items.
Returns: A ProfileItemEnumerator of parametric profile items.

Tekla.Structures.Catalogs.CatalogHandler.GetRebarItems
Returns an enumerator of rebar items.
Returns: A RebarItemEnumerator of rebar items.

Tekla.Structures.Catalogs.CatalogHandler.GetMeshItems
Returns an enumerator of mesh items.
Returns: A MeshItemEnumerator of mesh items.

Tekla.Structures.Catalogs.CatalogHandler.GetBoltItems
Returns an enumerator of all bolt items.
Returns: A BoltItemEnumerator of all bolt items.

Tekla.Structures.Catalogs.CatalogHandler.GetShapeItems
Returns an enumerator of all shape items.
Returns: A ShapeItemEnumerator of all shape items.

Tekla.Structures.Catalogs.CatalogHandler.GetMaterialItems
Returns an enumerator of all material items.
Returns: A MaterialItemEnumerator of all material items.

Tekla.Structures.Catalogs.CatalogHandler.GetMaterialMarketSizes
Returns an enumerator of all material marketsizes.
Data is read from XS_PROFDB\marketsizes.dat file.
Throws Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException: Thrown when initialization of MaterialMarketSizesItemEnumerator fails.
Returns: A MaterialMarketSizesItemEnumerator of all material marketsizes.

Tekla.Structures.Catalogs.CatalogHandler.GetPrinterItems
Returns an enumerator of all printer items.
Returns: A PrinterItemEnumerator of all printer items.

Tekla.Structures.Catalogs.CatalogHandler.GetComponentItems
Returns an enumerator of all component items.
Returns: A ComponentItemEnumerator of all component items.

Tekla.Structures.Catalogs.CatalogHandler.GetUserPropertyItems
Returns an enumerator of all user property items.
Returns: A UserPropertyItemEnumerator of all user property items.

Tekla.Structures.Catalogs.CatalogHandler.GetUserPropertyItems(Tekla.Structures.Catalogs.CatalogObjectTypeEnum)
Returns an enumerator of user property items of the given object type.
objectType: The object type to be used.
Returns: A UserPropertyItemEnumerator of user property items of the given object type.

Tekla.Structures.Catalogs.CatalogHandler.GetDrawingItems
Returns an enumerator of all drawing items.
Returns: A DrawingItemEnumerator of all drawing catalog items.

Tekla.Structures.Catalogs.CatalogHandler.SaveProfileDatabase
Saves the profile database.
Returns: True on success.

Tekla.Structures.Catalogs.CatalogHandler.ImportLibraryProfileItems(System.String)
Imports library profile items (*.lis) from folder to profile catalog.
Import overrides the existing profiles in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportLibraryProfileItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Library profiles imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportParametricProfileItems(System.String)
Imports parametric profile items (*.uel) from folder to profile catalog.
Import overrides the existing profiles in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportParametricProfileItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Parametric profiles imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportMaterialItems(System.String)
Imports material items (*.lis) from folder to material catalog.
Import overrides the existing materials in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportMaterialItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Materials imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportCustomComponentItems(System.String)
Imports custom component items (*.uel) from path to component catalog.
Import overrides the existing custom components in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportCustomComponentItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Custom components imported successfully to catalog.");
}
}
path: The path to be used for import. This can be a uel file or a folder containing one or more uel files.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportRebarItems(System.String)
Imports rebar items (*.rexp) from folder to reinforcement catalog.
Import overrides the existing rebar item in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportRebarItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Rebar items imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportMeshItems(System.String)
Imports mesh items (*.mexp) from folder to mesh catalog.
Import overrides the existing mesh item in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportMeshItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Mesh items imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportBoltItems(System.String)
Imports bolt items and their assembly information (*.bass) from folder to bolt assembly catalog and bolt catalog.
Import overrides the existing bolts in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportBoltItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Bolts and bolt assemblies imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportDrawingItems(System.String)
Imports drawing setting items (*.tsds) from specified folder to model folder.
Import throws exception if model is not open.
Import overrides the existing drawing items in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportDrawingItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Drawing settings imported successfully to model.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ImportShapeItems(System.String)
Imports shape geometry items (*.tsc) from specified folder.
Import throws exception if model is not open.
Import overrides the existing shape items in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportShapeItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Shape geometries imported successfully to model.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.GetClientId
Get unique client id for application.
Client id must be used with sequential queries, like
object enumeration.
Returns: Client id